fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_НачисленияСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаПремии</name>
    <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type><types>String</types><stringQualifiers/></type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_НачисленияСотрудников/ВКМ_НачисленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_НачисленияСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_СуммаНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидНачисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <registerType>Balances</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	Если НЕ ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// ВКМ_Изменение_Начало
	Если НЕ ЗначениеЗаполнено(ВКМ_СуммаПремии) Или ВКМ_СуммаПремии <= 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма премии должна быть больше нуля.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// ВКМ_Изменение_Конец

	НДФЛ = ВКМ_ОбслуживаниеКлиентов.ВКМ_РассчитатьНДФЛ(ВКМ_СуммаПремии);
	СуммаКВыплате = ВКМ_СуммаПремии - НДФЛ;

	Движения.ВКМ_НачисленияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	ДвижениеПремии = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеПремии.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПремии.Период = Дата;
	ДвижениеПремии.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеПремии.ВКМ_ВидНачисления = НСтр("ru='Премия'");
	ДвижениеПремии.ВКМ_СуммаНачисления = ВКМ_СуммаПремии;

	ДвижениеНДФЛ = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеНДФЛ.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНДФЛ.Период = Дата;
	ДвижениеНДФЛ.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеНДФЛ.ВКМ_ВидНачисления = НСтр("ru='НДФЛ'");
	ДвижениеНДФЛ.ВКМ_СуммаНачисления = НДФЛ;

	ДвижениеВзаиморасчетов = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	ДвижениеВзаиморасчетов.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеВзаиморасчетов.Период = Дата;
	ДвижениеВзаиморасчетов.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеВзаиморасчетов.ВКМ_Сумма = СуммаКВыплате;

КонецПроцедуры

#КонецЕсли
